---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperties.IsValidIndex(System.Int32)
source: html/dea26a3b-bc9b-db11-447c-dd9698377155.htm
---
# Autodesk.Revit.DB.Visual.AssetProperties.IsValidIndex Method

Returns true if the provided index is valid.

## Syntax (C#)
```csharp
public bool IsValidIndex(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - Index to be validated.

## Returns
True if index is valid, false otherwise.